app/views/books/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" IN (2, 3, 4, 1)
---
  <%= format_average_stars(book) %>
  <% if book.reviews.any? %>