app/views/books/show.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 2]]
---
  Read all
  <%= link_to pluralize(@book.reviews.size, 'review'),
                        book_reviews_path(@book) %>