app/controllers/books_controller.rb

  def index
  	@available_at = Time.now
	@books = Book.all
---
SELECT "books".* FROM "books"