app/controllers/books_controller.rb

  def index
  @available_at = Time.now
  @books = Book.includes(:reviews).order(:title).page(params[:page])
---
SELECT "books".* FROM "books" ORDER BY "books"."title" ASC LIMIT 5 OFFSET 0
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" IN (2, 3, 4, 1)
SELECT COUNT(*) FROM "books"

def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("author", "created_at", "pages", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

def update
    if @book.update(book_params)
---
UPDATE "books" SET "price" = ?, "updated_at" = ? WHERE "books"."id" = 2  [["price", #<BigDecimal:b9aac1ac,'0.599E1',18(18)>], ["updated_at", Wed, 02 Apr 2014 01:01:11 UTC +00:00]]