app/controllers/reviews_controller.rb

def index
  @reviews = @book.reviews.order('created_at desc')
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ? ORDER BY created_at desc  [["book_id", 2]]

def create
  @review = @book.reviews.new(review_params)
  if @review.save
---
INSERT INTO "reviews" ("book_id", "comment", "created_at", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

def set_book
  @book = Book.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "2"]]